title: Internal TCP Port Sweep
id: 840e6e89-5314-4b4a-9f1f-00101d8e9a06
status: experimental
description: Detects one source contacting many destination ports on an internal host.
author: Mini SOC Lab
date: 2026-06-13
references:
    - https://attack.mitre.org/techniques/T1046/
logsource:
    category: network_connection
    product: suricata
detection:
    selection:
        event_type: 'flow'
        proto: 'TCP'
    timeframe: 1m
    condition: selection | count(dest_port) by src_ip >= 15
falsepositives:
    - Approved vulnerability scans
    - Monitoring systems
level: medium
tags:
    - attack.discovery
    - attack.t1046

