title: PowerShell With Suspicious Command Line Flags
id: 840e6e89-5314-4b4a-9f1f-00101d8e9a02
status: experimental
description: Detects encoded, hidden, or noninteractive PowerShell command-line patterns.
author: Mini SOC Lab
date: 2026-06-13
references:
    - https://attack.mitre.org/techniques/T1059/001/
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
    selection_flags:
        CommandLine|contains:
            - ' -enc '
            - ' -encodedcommand '
            - ' -windowstyle hidden'
            - ' -nop '
            - ' -noninteractive '
    condition: all of selection_*
falsepositives:
    - Administrative automation using encoded content
level: high
tags:
    - attack.execution
    - attack.t1059.001

