title: Multiple Windows Logon Failures From One Source
id: 840e6e89-5314-4b4a-9f1f-00101d8e9a01
status: experimental
description: Detects repeated failed interactive or network logons from one source address.
author: Mini SOC Lab
date: 2026-06-13
references:
    - https://attack.mitre.org/techniques/T1110/
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4625
    timeframe: 5m
    condition: selection | count(SourceIp) by SourceIp >= 5
falsepositives:
    - Stale service credentials
    - User password mistakes
level: medium
tags:
    - attack.credential_access
    - attack.t1110

