title: Multiple SSH Authentication Failures From One Source
id: 840e6e89-5314-4b4a-9f1f-00101d8e9a05
status: experimental
description: Detects repeated failed SSH authentication attempts from one source address.
author: Mini SOC Lab
date: 2026-06-13
references:
    - https://attack.mitre.org/techniques/T1110/001/
logsource:
    product: linux
    service: sshd
detection:
    selection:
        message|contains: 'Failed password'
    timeframe: 5m
    condition: selection | count(source_ip) by source_ip >= 5
falsepositives:
    - Mistyped passwords
    - Vulnerability scanners using approved credentials
level: medium
tags:
    - attack.credential_access
    - attack.t1110.001

